In [123]:
import pandas as pd
import numpy as np

In [129]:
# Sample data
Name = ['Megan', 'Salma', 'Cameron Diaz','Scarlet']
Age = [25, 30, 35,32]
Movie = ['Transformers', 'Desperado', 'Charlie Angels','Avengers']

In [ ]:
Name = ['Megan', 'Salma', 'Cameron Diaz','Scarlett','Megan','Scarlett','Scarlett']
Movie = ['Transformers', 'Desperado', 'Charlie Angels','Avengers','Transformers2','Avengers2','Avengers3']

In [130]:
"""Zip"""
#zip(iterable1,iterable2,iterable3)
#zip object

data=zip(Name,Age,Movie)
print(data)
print(type(data))

print(list(data))

<zip object at 0x13ab0e500>
<class 'zip'>
[('Megan', 25, 'Transformers'), ('Salma', 30, 'Desperado'), ('Cameron Diaz', 35, 'Charlie Angels'), ('Scarlet', 32, 'Avengers'), ('Megan', 42, 'Transformers2')]

In [131]:
data=list(zip(Name,Age,Movie))
df=pd.DataFrame(data,columns=['Name','Age','Movie'])
df

           Name  Age           Movie
0         Megan   25    Transformers
1         Salma   30       Desperado
2  Cameron Diaz   35  Charlie Angels
3       Scarlet   32        Avengers
4         Megan   42   Transformers2

In [133]:
for a,b,c in zip(df['Name'], df['Movie'],df['Age']):
    print(f"{a} has worked in {b} and is {c} years old")

Megan has worked in Transformers and is 25 years old
Salma has worked in Desperado and is 30 years old
Cameron Diaz has worked in Charlie Angels and is 35 years old
Scarlet has worked in Avengers and is 32 years old
Megan has worked in Transformers2 and is 42 years old

In [134]:
my_dict={}
for name, movie in zip(df['Name'],df['Movie']):
    my_dict[name]=movie

print(my_dict)

{'Megan': 'Transformers2', 'Salma': 'Desperado', 'Cameron Diaz': 'Charlie Angels', 'Scarlet': 'Avengers'}

In [135]:
my_dict={}
for name, movie in zip(df['Name'],df['Movie']):
    if name in my_dict:
        my_dict[name].append(movie)
    else:
        my_dict[name]=[movie]

print(my_dict)

{'Megan': ['Transformers', 'Transformers2'], 'Salma': ['Desperado'], 'Cameron Diaz': ['Charlie Angels'], 'Scarlet': ['Avengers']}

In [ ]:
"""Enumerate"""
#used it with iterables like list, tuple
#when we need both index and the corresponding element

In [136]:
Name = ['Megan', 'Salma', 'Cameron Diaz','Scarlet','Megan Fox']

for index, element in enumerate(Name):
    print(f'{index} value is {element}')

0 value is Megan
1 value is Salma
2 value is Cameron Diaz
3 value is Scarlet
4 value is Megan Fox

In [137]:
def double_age(x):
    for index, age in enumerate(x):
        x[index]=age*2

    return x


double_age(df['Age'])

/var/folders/2b/zl_96rss51b7s3f624fmp24m0000gn/T/ipykernel_14292/3618946741.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[index]=age*2
/var/folders/2b/zl_96rss51b7s3f624fmp24m0000gn/T/ipykernel_14292/3618946741.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[index]=age*2
/var/folders/2b/zl_96rss51b7s3f624fmp24m0000gn/T/ipykernel_14292/3618946741.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[index]=age*2
/var/folders/2b/zl_96rss51b7s3f624fmp24m0000gn/T/ipykernel_14292/3618946741.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[index]=age*2
/var/folders/2b/zl_96rss51b7s3f624fmp24m0000gn/T/ipykernel_14292/3618946741.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[index]=age*2

0    50
1    60
2    70
3    64
4    84
Name: Age, dtype: int64

In [ ]:
"""Isinstance"""
#syntax isinstace(obj,(subclass,subclass1,subclass2))

In [142]:
x='Helloooooo'

if isinstance(x, (int,float)):
    print(f"{x} is integer/float")
else:
    print(f"{x} is not integer")

Helloooooo is not integer

In [143]:
Name = ['Megan', 'Salma', 'Cameron Diaz','Scarlet','Megan']
Age = [25, 30, 35,32,'twenty five']
Movie = ['Transformers', 'Desperado', 'Charlie Angels','Avengers','Transformers2']

data=list(zip(Name,Age,Movie))
#dataframe
df=pd.DataFrame(data,columns=['Name','Age','Movie'])



numeric_age=df[df['Age'].apply(lambda x: isinstance(x,(int,float)))]

numeric_age

           Name Age           Movie
0         Megan  25    Transformers
1         Salma  30       Desperado
2  Cameron Diaz  35  Charlie Angels
3       Scarlet  32        Avengers

In [145]:
l = [10, 20, 'swap', '40']  #isalpha and string
l1=[]
for element in l:
    if isinstance(element, str) and element.isalpha():
        element=element.upper()
        l1.append(element)

l1

['SWAP']

In [146]:
"""df.at"""
Name = ['Megan', 'Salma', 'Cameron Diaz','Scarlet','Megan']
Age = [25, 30, 35,32,'twenty five']
Movie = ['Transformers', 'Desperado', 'Charlie Angels','Avengers','Transformers2']

data=list(zip(Name,Age,Movie))
#dataframe
df=pd.DataFrame(data,columns=['Name','Age','Movie'])

In [147]:
df

           Name          Age           Movie
0         Megan           25    Transformers
1         Salma           30       Desperado
2  Cameron Diaz           35  Charlie Angels
3       Scarlet           32        Avengers
4         Megan  twenty five   Transformers2

In [148]:
df.at[2,'Name']

'Cameron Diaz'

In [151]:
df.at[4,'Age']= 26
df

           Name Age           Movie
0         Megan  25    Transformers
1         Salma  30       Desperado
2  Cameron Diaz  35  Charlie Angels
3       Scarlet  32        Avengers
4         Megan  26   Transformers2

In [156]:
"""df.apply"""


data = {
    'Column1': [1, 2, 3, 4, 5],
    'Column2': [10, 20, 30, 40, 50]
}

df = pd.DataFrame(data)

df

   Column1  Column2
0        1       10
1        2       20
2        3       30
3        4       40
4        5       50

In [155]:
def sum_row(x):
    return x.sum()

result_rows=df.apply(sum_row,axis=0)
result_rows

Column1     15
Column2    150
dtype: int64

In [157]:
def multiply_col(x):
    return x.prod()

result_cols=df.apply(multiply_col,axis=1)
result_cols

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [152]:
df

           Name Age           Movie
0         Megan  25    Transformers
1         Salma  30       Desperado
2  Cameron Diaz  35  Charlie Angels
3       Scarlet  32        Avengers
4         Megan  26   Transformers2

In [153]:
def age_modify(x):
    if x<30:
        return x*0.9
    else:
        return x*1.1


df['Modified_Age']=df['Age'].apply(age_modify)
df

           Name Age           Movie  Modified_Age
0         Megan  25    Transformers          22.5
1         Salma  30       Desperado          33.0
2  Cameron Diaz  35  Charlie Angels          38.5
3       Scarlet  32        Avengers          35.2
4         Megan  26   Transformers2          23.4

In [158]:
"""df.applymap(func)"""

# Sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

In [159]:
def multiply_by_2(x):
    return x*2

df_multiply=df.applymap(multiply_by_2)
df_multiply

/var/folders/2b/zl_96rss51b7s3f624fmp24m0000gn/T/ipykernel_14292/976964792.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_multiply=df.applymap(multiply_by_2)

   A   B   C
0  2   8  14
1  4  10  16
2  6  12  18

In [160]:
"""df.iterrows()"""

# Sample data
Name = ['Megan', 'Salma', 'Cameron Diaz','Scarlet','Megan']
Age = [25, 30, 35,32,25]
Movie = ['Transformers', 'Desperado', 'Charlie Angels','Avengers','Transformers2']

data=list(zip(Name,Age,Movie))
#dataframe
df=pd.DataFrame(data,columns=['Name','Age','Movie'])
df

           Name  Age           Movie
0         Megan   25    Transformers
1         Salma   30       Desperado
2  Cameron Diaz   35  Charlie Angels
3       Scarlet   32        Avengers
4         Megan   25   Transformers2

In [161]:
for index, row in df.iterrows():
    print(index)
    print(row)
    print()

0
Name            Megan
Age                25
Movie    Transformers
Name: 0, dtype: object

1
Name         Salma
Age             30
Movie    Desperado
Name: 1, dtype: object

2
Name       Cameron Diaz
Age                  35
Movie    Charlie Angels
Name: 2, dtype: object

3
Name      Scarlet
Age            32
Movie    Avengers
Name: 3, dtype: object

4
Name             Megan
Age                 25
Movie    Transformers2
Name: 4, dtype: object

In [163]:
type(df.loc[0])

pandas.core.series.Series

In [164]:
for index, row in df.iterrows():
    if row['Age']>=30:
        df.at[index,'Age']='Old'
    else:
        df.at[index,'Age']='young'

df

/var/folders/2b/zl_96rss51b7s3f624fmp24m0000gn/T/ipykernel_14292/1632494236.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'young' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.at[index,'Age']='young'

           Name    Age           Movie
0         Megan  young    Transformers
1         Salma    Old       Desperado
2  Cameron Diaz    Old  Charlie Angels
3       Scarlet    Old        Avengers
4         Megan  young   Transformers2

In [165]:
"""df.itertuples()"""

# Sample data
Name = ['Megan', 'Salma', 'Cameron Diaz','Scarlet','Megan']
Age = [25, 30, 35,32,25]
Movie = ['Transformers', 'Desperado', 'Charlie Angels','Avengers','Transformers2']

data=list(zip(Name,Age,Movie))
#dataframe
df=pd.DataFrame(data,columns=['Name','Age','Movie'])
df

           Name  Age           Movie
0         Megan   25    Transformers
1         Salma   30       Desperado
2  Cameron Diaz   35  Charlie Angels
3       Scarlet   32        Avengers
4         Megan   25   Transformers2

In [166]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, Name='Megan', Age=25, Movie='Transformers')
Pandas(Index=1, Name='Salma', Age=30, Movie='Desperado')
Pandas(Index=2, Name='Cameron Diaz', Age=35, Movie='Charlie Angels')
Pandas(Index=3, Name='Scarlet', Age=32, Movie='Avengers')
Pandas(Index=4, Name='Megan', Age=25, Movie='Transformers2')

In [167]:
for row in df.itertuples():
    print(f"row index:{row.Index} and name is {row.Name}")

row index:0 and name is Megan
row index:1 and name is Salma
row index:2 and name is Cameron Diaz
row index:3 and name is Scarlet
row index:4 and name is Megan

In [168]:
"""Moving multiple dataframes"""


# Sample data
Name = ['Megan', 'Salma', 'Cameron Diaz','Scarlet','Megan']
Age = [25, 30, 35,32,25]
Movie = ['Transformers', 'Desperado', 'Charlie Angels','Avengers','Transformers2']

data=list(zip(Name,Age,Movie))
#dataframe
df=pd.DataFrame(data,columns=['Name','Age','Movie'])
df

           Name  Age           Movie
0         Megan   25    Transformers
1         Salma   30       Desperado
2  Cameron Diaz   35  Charlie Angels
3       Scarlet   32        Avengers
4         Megan   25   Transformers2

In [169]:
# Sample DataFrame
df2 = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

In [170]:

data = {
    'Column1': [1, 2, 3, 4, 5],
    'Column2': [10, 20, 30, 40, 50]
}

df3 = pd.DataFrame(data)

df3

   Column1  Column2
0        1       10
1        2       20
2        3       30
3        4       40
4        5       50

In [171]:
dataframes={'Movies':df,'Random1':df2,'Random3':df3}

for name, df in dataframes.items():
    filename=f"{name}.csv"
    df.to_csv(filename, index=False)
    print('All dataframes are successfully saved on local machine')

All dataframes are successfully saved on local machine
All dataframes are successfully saved on local machine
All dataframes are successfully saved on local machine

In [18]:
import pandas as pd

data = {
    'Product': ['Laptop', 'Phone', 'Tablet', 'Monitor', 'Keyboard'],
    'Price': [1200, 800, 300, 150, 50]
}

df = pd.DataFrame(data)

In [23]:
data = {
    'A': [1, 2, 3, 4],
    'B': [10, 20, 30, 40],
    'C': [100, 200, 300, 400]
}

df = pd.DataFrame(data)

In [3]:
# Sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

In [6]:
# Sample list
fruits = ['apple', 'banana', 'cherry']

In [5]:
#given an integer array nums and an integer k returns True if there are two distinct indices  and j in the array such that
#nums[i] == nums[j] and abs(i-j) <= k
nums=[5,7,9,5]
k=3

def arrfunc(nums,k):    
    my_dict={}

    for index, value in enumerate(nums):
        if value in my_dict and abs(index- my_dict[value]) <= k:
            return True
        my_dict[value]=index

    return False
    

arrfunc(nums,k)

{0: 5, 1: 7, 2: 9, 3: 5}

In [15]:
split=''
def check_char(string):
    split=string.split()
    if str(split[0])[0].lower() == str(split[1])[0].lower():
        return True
    else:
        return False

In [17]:
check_char('Lazy Dog')

False

In [26]:
inp_str="( { [ ) ] }"
#as every open bracket has its corresponding closer bracket. Match parantheses are in correct order, hence they are balanced, 
#and function will return True

my_dict={"(": ")", "{": "}", "[": "]"}
def isvalid(string):
    lst=[]
    for x in string:
        if x in my_dict.keys():
            lst.append(x)
        elif x in my_dict.values():
            if lst and my_dict[lst[-1]] == x :
                lst.pop()
            else:
                return False

In [27]:
isvalid(inp_str)

False

In [ ]:
lst=[10,20,30,40,50,60,10,10,20,30,30,30,30,30,40,50,50,50,50]

my_dict={}

for element in lst:
    if element in my_dict:
        my_dict[element]+=1
    else:
        my_dict[element] =1

print(my_dict)

In [118]:
"""Write a program to retrieve the elements which matches the frequency given in input
nums=[0,0,2,3,3,3,3,5,5], k=2"""

nums=[0,0,2,3,3,3,3,5,5]
k=2
output={}
lst=[]
def num_count(nums,k):
    for i in nums:
        if i in output:
            output[i]+=1
        else:
            output[i]=1

    for i,j in output.items():
        if j == k:
            lst.append(i)
    
        
    return lst
            
num_count(nums,k)

[0, 5]

In [119]:
# Sample DataFrame
data = {'column': ['30', '40', '50', 'Free']}
df = pd.DataFrame(data)

# Convert column values to numeric, errors='coerce' converts non-numeric values to NaN
numeric_column = pd.to_numeric(df['column'], errors='coerce')

# Count the number of NaN values
non_numeric_count = numeric_column.isna().sum()

print("Number of non-numeric values:", non_numeric_count)

Number of non-numeric values: 1

In [121]:
data = {'column': [30, 40, 50, 'Free']}
df = pd.DataFrame(data)

df['Numeric']=[ True if isinstance(x,(int,float)) else False for x in df['column']]
df

  column  Numeric
0     30     True
1     40     True
2     50     True
3   Free    False